RIOT-OS/RIOT/drivers/kw41zrf/kw41zrf_radio_ops.c
/*
 * SPDX-FileCopyrightText: 2025 HAW Hamburg
 * SPDX-License-Identifier: LGPL-2.1-only
 */

/**
 * @ingroup     drivers_kw41zrf
 * @{
 *
 * @file
 * @brief       Implementation of 802.15.4 Radio HAL interface for KW41ZRF
 *              transceivers.
 *
 * @author     Stepan Konoplev <stepan.konoplev@haw-hamburg.de>
 * @}
 */

#include <stdio.h>
#include <errno.h>
#include <stdint.h>
#include <assert.h>
#include <stdbool.h>

#include "kw41zrf.h"
#include "kw41zrf_netdev.h"
#include "kw41zrf_intern.h"
#include "kw41zrf_getset.h"
#include "vendor/MKW41Z4.h"

#include "bit.h"
#include "log.h"
#include "iolist.h"
#include "byteorder.h"
#include "net/eui64.h"
#include "net/ieee802154.h"
#include "net/ieee802154/radio.h"

#ifdef MODULE_OD
#include "od.h"
#endif

#define ENABLE_DEBUG 0
#include "debug.h"

#define CHECKSUM_MASK               0xFFFF

#define ALL_FRAMES_TYPE_MASK        (ZLL_RX_FRAME_FILTER_BEACON_FT_MASK | \
                                     ZLL_RX_FRAME_FILTER_DATA_FT_MASK    | \
                                     ZLL_RX_FRAME_FILTER_CMD_FT_MASK     | \
                                     ZLL_RX_FRAME_FILTER_ACK_FT_MASK)

/* IRQ mask: RF (0-6), WAKE (8), TMR_IRQ (16-19), TMR_MSK (20-23) */
#define KW41ZRF_IRQS    (0x00ff017fUL)

static kw41zrf_t intern_dev;
static const ieee802154_radio_ops_t kw41zrf_ops;
static ieee802154_dev_t *_kw41zrf_hal_dev;

static int _request_on(ieee802154_dev_t *dev)
{
    (void)dev;
    DEBUG("[kw41zrf] request_on\n");
    kw41zrf_set_power_mode(&intern_dev, KW41ZRF_POWER_IDLE);
    return 0;
}

static int _confirm_on(ieee802154_dev_t *dev)
{
    (void)dev;
    DEBUG("[kw41zrf] confirm_on\n");
    if (kw41zrf_is_dsm()) {
        return -EAGAIN;
    }
    return 0;
}

static int _off(ieee802154_dev_t *dev)
{
    (void)dev;
    DEBUG("[kw41zrf] off\n");
    if (!kw41zrf_is_dsm()) {
        kw41zrf_set_power_mode(&intern_dev, KW41ZRF_POWER_DSM);
    }
    return 0;
}

static int _write(ieee802154_dev_t *hal, const iolist_t *psdu)
{
    DEBUG("[kw41zrf] write\n");
    (void)hal;
    uint8_t len = 0;
    uint8_t *data = psdu->iol_base;

    /* Indicate if an ack was requested to handle auto ack */
    if (*data & IEEE802154_FCF_ACK_REQ) {
        bit_set32(&ZLL->PHY_CTRL, ZLL_PHY_CTRL_RXACKRQD_SHIFT);
    }
    else {
        bit_clear32(&ZLL->PHY_CTRL, ZLL_PHY_CTRL_RXACKRQD_SHIFT);
    }

    /* load packet data into buffer */
    for (const iolist_t *iol = psdu; iol; iol = iol->iol_next) {
        /* current packet data + FCS too long */
        if ((len + iol->iol_len) > (KW41ZRF_MAX_PKT_LENGTH - IEEE802154_FCS_LEN)) {
            return -EOVERFLOW;
        }
        memcpy(&((uint8_t *)ZLL->PKT_BUFFER_TX)[len + 1], iol->iol_base, iol->iol_len);
        len += iol->iol_len;
    }

    /*
     * First octet in the TX buffer contains the frame length.
     * Nbytes = FRAME_LEN - 2 -> FRAME_LEN = Nbytes + 2
     * MKW41Z ref. man. 44.6.2.6.3.1.3 Sequence T (Transmit), p. 2147
     */
    *((volatile uint8_t *)&ZLL->PKT_BUFFER_TX[0]) = len + IEEE802154_FCS_LEN;

#if defined(MODULE_OD) && ENABLE_DEBUG
    od_hex_dump((const uint8_t *)ZLL->PKT_BUFFER_TX, len, OD_WIDTH_DEFAULT);
#endif

    return 0;
}

static int _len(ieee802154_dev_t *dev)
{
    (void)dev;
    DEBUG("[kw41zrf] len\n");
    uint32_t len = ((ZLL->IRQSTS & ZLL_IRQSTS_RX_FRAME_LENGTH_MASK) >>
                    ZLL_IRQSTS_RX_FRAME_LENGTH_SHIFT) - IEEE802154_FCS_LEN;
    return (int)len;
}

static int _read(ieee802154_dev_t *hal, void *buf, size_t size, ieee802154_rx_info_t *info)
{
    DEBUG("[kw41zrf] read\n");

    if (!buf) {
        return 0;
    }

    uint8_t pkt_len = _len(hal);
    pkt_len = size < pkt_len ? size : pkt_len;

#if defined(MODULE_OD) && ENABLE_DEBUG
    od_hex_dump((const uint8_t *)ZLL->PKT_BUFFER_RX, pkt_len, OD_WIDTH_DEFAULT);
#endif

    /* Read packet buffer. */
    /* Don't use memcpy to work around a presumed compiler bug in
     * arm-none-eabi-gcc 7.3.1 2018-q2-6 */
    for (int i = 0; i < pkt_len; i++) {
        ((uint8_t *)buf)[i] = ((uint8_t *)ZLL->PKT_BUFFER_RX)[i];
    }

    if (info) {
        info->lqi = kw41zrf_get_lqi_value(&intern_dev);
        info->rssi = kw41zrf_get_rssi_value(&intern_dev);
    }

    return pkt_len;
}

static int _request_op(ieee802154_dev_t *hal, ieee802154_hal_op_t op, void *ctx)
{
    (void)hal;
    int res = -ENOTSUP;
    uint8_t state = kw41zrf_get_sequence(&intern_dev);

    switch (op) {
    case IEEE802154_HAL_OP_TRANSMIT:
        DEBUG("[kw41zrf] request_op TX\n");
        if (state != XCVSEQ_IDLE) {
            return -EBUSY;
        }

        if (kw41zrf_ack_requested(&intern_dev)) {
            kw41zrf_set_sequence(&intern_dev, XCVSEQ_TX_RX | ZLL_PHY_CTRL_TC3TMOUT_MASK);
        }
        else {
            kw41zrf_set_sequence(&intern_dev, XCVSEQ_TRANSMIT);
        }
        return 0;
    case IEEE802154_HAL_OP_SET_RX:
        DEBUG("[kw41zrf] request_op RX\n");

        if (state == XCVSEQ_RECEIVE) {
            return 0;
        }

        if (state != XCVSEQ_IDLE) {
            return -EBUSY;
        }

        kw41zrf_set_sequence(&intern_dev, XCVSEQ_RECEIVE);
        return 0;
    case IEEE802154_HAL_OP_SET_IDLE:
        DEBUG("[kw41zrf] request_op IDLE\n");

        assert(ctx);
        bool force = *((bool *)ctx);

        if (state == XCVSEQ_IDLE) {
            return 0;
        }

        if (force) {
            /* aborts any sequence by setting idle sequence */
            kw41zrf_set_sequence(&intern_dev, XCVSEQ_IDLE);
            return 0;
        }

        if (!kw41zrf_can_switch_to_idle(&intern_dev)) {
            return -EBUSY;
        }

        kw41zrf_set_sequence(&intern_dev, XCVSEQ_IDLE);
        return 0;
    case IEEE802154_HAL_OP_CCA:
        DEBUG("[kw41zrf] request_op CCA\n");

        if (state != XCVSEQ_IDLE) {
            return -EBUSY;
        }

        kw41zrf_set_sequence(&intern_dev, XCVSEQ_CCA);
        return 0;
    }
    return res;
}

static int _confirm_op(ieee802154_dev_t *dev, ieee802154_hal_op_t op, void *ctx)
{
    (void)dev;
    ieee802154_tx_info_t *info = ctx;

    bool eagain = false;
    uint8_t state = kw41zrf_get_sequence(&intern_dev);

    switch (op) {
    case IEEE802154_HAL_OP_TRANSMIT:
        DEBUG("[kw41zrf] confirm_op TX\n");
        if (state != XCVSEQ_IDLE) {
            return -EAGAIN;
        }

        if (info) {
            if (intern_dev.cca_busy) {
                intern_dev.tx_status = TX_STATUS_MEDIUM_BUSY;
            }
            info->status = intern_dev.tx_status;
        }

