RIOT-OS/RIOT/drivers/kw41zrf/kw41zrf_radio_ops.c
        return 0;
    case IEEE802154_HAL_OP_SET_RX:
        DEBUG("[kw41zrf] confirm_op RX\n");
        eagain = state != XCVSEQ_RECEIVE;
        break;
    case IEEE802154_HAL_OP_SET_IDLE:
        DEBUG("[kw41zrf] confirm_op IDLE\n");
        eagain = state != XCVSEQ_IDLE;
        break;
    case IEEE802154_HAL_OP_CCA:
        DEBUG("[kw41zrf] confirm_op CCA\n");
        eagain = state != XCVSEQ_IDLE;
        assert(ctx);

        *((bool *)ctx) = intern_dev.cca_busy;
        break;
    default:
        assert(false);
        return -ENOTSUP;
    }

    if (eagain) {
        return -EAGAIN;
    }

    return 0;
}

int _set_cca_mode(ieee802154_dev_t *dev, ieee802154_cca_mode_t mode)
{
    (void)dev;
    uint8_t cca_type = 0;

    DEBUG("[kw41zrf] set_cca_mode\n");

    switch (mode) {
    case IEEE802154_CCA_MODE_ED_THRESHOLD:
        cca_type = KW41ZRF_CCATYPE_MODE1;
        break;
    case IEEE802154_CCA_MODE_CARRIER_SENSING:
        cca_type = KW41ZRF_CCATYPE_MODE2;
        break;
    case IEEE802154_CCA_MODE_ED_THRESH_OR_CS:
        cca_type = KW41ZRF_CCATYPE_MODE3;
        kw41zrf_set_cca3_mode(0);
        break;
    case IEEE802154_CCA_MODE_ED_THRESH_AND_CS:
        cca_type = KW41ZRF_CCATYPE_MODE3;
        kw41zrf_set_cca3_mode(1);
        break;
    default:
        return -ENOTSUP;
    }
    kw41zrf_set_cca_type(&intern_dev, cca_type);
    return 0;
}

int _set_cca_threshold(ieee802154_dev_t *dev, int8_t threshold)
{
    (void)dev;
    DEBUG("[kw41zrf] set_cca_threshold\n");
    kw41zrf_set_cca_threshold(&intern_dev, threshold);
    return 0;
}

int _set_csma_params(ieee802154_dev_t *dev, const ieee802154_csma_be_t *bd, int8_t retries)
{
    (void)bd;
    (void)dev;

    DEBUG("[kw41zrf] set_csma_params\n");

    if (retries < 0) {
        bit_clear32(&ZLL->PHY_CTRL, ZLL_PHY_CTRL_CCABFRTX_SHIFT);
        return 0;
    }
    else if (retries == 0) {
        bit_set32(&ZLL->PHY_CTRL, ZLL_PHY_CTRL_CCABFRTX_SHIFT);
        return 0;
    }

    return -EINVAL;
}

int _set_frame_filter_mode(ieee802154_dev_t *hal, ieee802154_filter_mode_t mode)
{
    (void)hal;

    DEBUG("[kw41zrf] set_frame_filter_mode\n");

    switch (mode) {
    case IEEE802154_FILTER_ACCEPT:
        bit_clear32(&ZLL->RX_FRAME_FILTER, ZLL_RX_FRAME_FILTER_ACTIVE_PROMISCUOUS_SHIFT);
        bit_set32(&ZLL->PHY_CTRL, ZLL_PHY_CTRL_CRC_MSK_SHIFT);

        ZLL->RX_FRAME_FILTER = (ZLL->RX_FRAME_FILTER & ~ALL_FRAMES_TYPE_MASK) |
                               ALL_FRAMES_TYPE_MASK;
        intern_dev.filter_mode = IEEE802154_FILTER_ACCEPT;
        break;

    case IEEE802154_FILTER_ACK_ONLY:
        bit_clear32(&ZLL->RX_FRAME_FILTER, ZLL_RX_FRAME_FILTER_ACTIVE_PROMISCUOUS_SHIFT);
        bit_set32(&ZLL->PHY_CTRL, ZLL_PHY_CTRL_CRC_MSK_SHIFT);

        ZLL->RX_FRAME_FILTER = (ZLL->RX_FRAME_FILTER & ~ALL_FRAMES_TYPE_MASK)
                               | ZLL_RX_FRAME_FILTER_ACK_FT_MASK;

        intern_dev.filter_mode = IEEE802154_FILTER_ACK_ONLY;
        break;

    case IEEE802154_FILTER_PROMISC:
        bit_set32(&ZLL->RX_FRAME_FILTER, ZLL_RX_FRAME_FILTER_ACTIVE_PROMISCUOUS_SHIFT);

        intern_dev.filter_mode = IEEE802154_FILTER_PROMISC;
        break;

    case IEEE802154_FILTER_SNIFFER:
        bit_set32(&ZLL->PHY_CTRL, ZLL_PHY_CTRL_PROMISCUOUS_SHIFT);
        bit_clear32(&ZLL->PHY_CTRL, ZLL_PHY_CTRL_CRC_MSK_SHIFT);

        intern_dev.filter_mode = IEEE802154_FILTER_SNIFFER;
        break;

    default:
        return -ENOTSUP;
    }
    return 0;
}

static int _get_frame_filter_mode(ieee802154_dev_t *hal, ieee802154_filter_mode_t *mode)
{
    (void)hal;
    DEBUG("[kw41zrf] get_frame_filter_mode\n");
    *mode = intern_dev.filter_mode;
    return 0;
}

int _config_addr_filter(ieee802154_dev_t *dev, ieee802154_af_cmd_t cmd, const void *value)
{
    (void)dev;

    DEBUG("[kw41zrf] config_addr_filter\n");

    switch (cmd) {
    case IEEE802154_AF_SHORT_ADDR:
        kw41zrf_set_addr_short(&intern_dev, value);
        break;
    case IEEE802154_AF_EXT_ADDR: {
            eui64_t addr;
            uint64_t tmp;
            memcpy(&tmp, value, sizeof(uint64_t));
            addr.uint64.u64 = byteorder_swapll(tmp);
            kw41zrf_set_addr_long(&intern_dev, &addr);
            break;
        }
    case IEEE802154_AF_PANID:
        kw41zrf_set_pan(&intern_dev, *((const uint16_t *)value));
        break;
    case IEEE802154_AF_PAN_COORD:
        kw41zrf_set_pan_coord(*((const uint8_t *)value));
        break;
    }
    return 0;
}

uint16_t _calc_short_addr_checksum(uint16_t short_addr, uint16_t dest_pan_id)
{
    return (short_addr + dest_pan_id) & CHECKSUM_MASK;
}

uint16_t _calc_ext_addr_checksum(const eui64_t *ext_addr, uint16_t dest_pan_id)
{
    uint16_t checksum = 0;

    checksum = (ext_addr->uint16[0].u16 + dest_pan_id) & CHECKSUM_MASK;
    checksum = (checksum + ext_addr->uint16[1].u16) & CHECKSUM_MASK;
    checksum = (checksum + ext_addr->uint16[2].u16) & CHECKSUM_MASK;
    checksum = (checksum + ext_addr->uint16[3].u16) & CHECKSUM_MASK;
    return checksum;
}

void _update_next_free_idx(void)
{
    DEBUG("[kw41zrf] update_next_free_idx\n");
    bit_set32(&ZLL->SAM_TABLE, ZLL_SAM_TABLE_FIND_FREE_IDX_SHIFT);
    /* wait while hw updating next free index */
    while (ZLL->SAM_TABLE & ZLL_SAM_TABLE_SAM_BUSY_MASK) {}

}

int _add_to_sam_table(uint16_t checksum)
{
    uint8_t free_idx = kw41zrf_get_1st_free_idx_sap0();

    DEBUG("[kw41zrf] add_to_sam_table\n");

    if (kw41zrf_get_partition_start(ZLL_SAM_CTRL_SAA0_START_MASK,
                                    ZLL_SAM_CTRL_SAA0_START_SHIFT) >= free_idx) {
        return -ENOSPC;
    }

    uint32_t entry = (checksum << ZLL_SAM_TABLE_SAM_CHECKSUM_SHIFT)
                     | (free_idx << ZLL_SAM_TABLE_SAM_INDEX_SHIFT)
                     | (1 << ZLL_SAM_TABLE_SAM_INDEX_EN_SHIFT)
                     | (0 << ZLL_SAM_TABLE_SAM_INDEX_INV_SHIFT)
                     | (1 << ZLL_SAM_TABLE_SAM_INDEX_WR_SHIFT);

    ZLL->SAM_TABLE = entry;
    return 0;
}

int _remove_from_sam_table(uint16_t checksum)
{
    uint8_t end_idx = kw41zrf_get_partition_start(ZLL_SAM_CTRL_SAA0_START_MASK,
                                                  ZLL_SAM_CTRL_SAA0_START_SHIFT);

    DEBUG("[kw41zrf] remove_from_sam_table\n");

    for (uint8_t idx = 0; idx < end_idx; idx++) {

        ZLL->SAM_TABLE = (idx << ZLL_SAM_TABLE_SAM_INDEX_SHIFT) |
                         (1 << ZLL_SAM_TABLE_SAM_INDEX_WR_SHIFT);
        uint16_t entry_checksum = ZLL->SAM_TABLE & ZLL_SAM_TABLE_SAM_CHECKSUM_MASK;

