RIOT-OS/RIOT/drivers/kw41zrf/kw41zrf_radio_ops.c
        if (checksum == entry_checksum) {
            ZLL->SAM_TABLE = (idx << ZLL_SAM_TABLE_SAM_INDEX_SHIFT)
                             | (0 << ZLL_SAM_TABLE_SAM_INDEX_EN_SHIFT)
                             | (1 << ZLL_SAM_TABLE_SAM_INDEX_INV_SHIFT)
                             | (0 << ZLL_SAM_TABLE_SAM_INDEX_WR_SHIFT);

            _update_next_free_idx();
            return 0;
        }
    }

    return -ENOENT;
}

int _config_src_addr_match(ieee802154_dev_t *dev, ieee802154_src_match_t cmd, const void *value)
{
    (void)dev;
    uint16_t pan_id = kw41zrf_get_pan(&intern_dev);
    uint16_t checksum = 0;
    eui64_t *ext_addr = 0;
    network_uint16_t *short_addr = 0;

    DEBUG("[kw41zrf] config_src_addr_match\n");

    switch (cmd) {
    case IEEE802154_SRC_MATCH_EN: {
            const bool enable = *((const bool *)value);
            if (enable) {
                bit_set32(&ZLL->SAM_TABLE, ZLL_SAM_TABLE_ACK_FRM_PND_SHIFT);
            }
            else {
                bit_clear32(&ZLL->SAM_TABLE, ZLL_SAM_TABLE_ACK_FRM_PND_SHIFT);
            }
            break;
        }
    case IEEE802154_SRC_MATCH_SHORT_ADD:
        short_addr = (network_uint16_t *)value;
        checksum = _calc_short_addr_checksum(short_addr->u16, pan_id);
        return _add_to_sam_table(checksum);
    case IEEE802154_SRC_MATCH_SHORT_CLEAR:
        short_addr = (network_uint16_t *)value;
        checksum = _calc_short_addr_checksum(short_addr->u16, pan_id);
        return _remove_from_sam_table(checksum);
    case IEEE802154_SRC_MATCH_EXT_ADD:
        ext_addr = (eui64_t *)value;
        checksum = _calc_ext_addr_checksum(ext_addr, pan_id);
        return _add_to_sam_table(checksum);
    case IEEE802154_SRC_MATCH_EXT_CLEAR:
        ext_addr = (eui64_t *)value;
        checksum = _calc_ext_addr_checksum(ext_addr, pan_id);
        return _remove_from_sam_table(checksum);
    }
    return 0;
}

/* Common CCA check handler code for sequences Transmit and Transmit/Receive */
static uint32_t _isr_event_seq_t_ccairq(kw41zrf_t *dev, uint32_t irqsts)
{
    uint32_t handled_irqs = 0;

    DEBUG("[kw41zrf] _isr_event_seq_t_ccairq\n");

    if (irqsts & ZLL_IRQSTS_CCAIRQ_MASK) {
        /* CCA before TX has completed */
        handled_irqs |= ZLL_IRQSTS_CCAIRQ_MASK;
        dev->cca_busy = (irqsts & ZLL_IRQSTS_CCA_MASK) > 0;
    }
    return handled_irqs;
}

/* Handler for standalone CCA */
static uint32_t _isr_event_seq_cca(kw41zrf_t *dev, uint32_t irqsts,
                                   bool *indicate_hal_event,
                                   ieee802154_trx_ev_t *hal_event)
{
    uint32_t handled_irqs = 0;

    DEBUG("[kw41zrf] _isr_event_seq_cca\n");

    if (irqsts & ZLL_IRQSTS_SEQIRQ_MASK) {
        /* Finished CCA sequence */
        handled_irqs |= ZLL_IRQSTS_SEQIRQ_MASK;
        dev->cca_busy = (irqsts & ZLL_IRQSTS_CCA_MASK) > 0;
        kw41zrf_abort_sequence(&intern_dev);

        if (_kw41zrf_hal_dev->cb) {
            *hal_event = IEEE802154_RADIO_CONFIRM_CCA;
            *indicate_hal_event = true;
        }
    }
    return handled_irqs;
}

/* Handler for Receive sequence */
static uint32_t _isr_event_seq_r(kw41zrf_t *dev, uint32_t irqsts,
                                 bool *indicate_hal_event,
                                 ieee802154_trx_ev_t *hal_event)
{
    (void)dev;
    uint32_t handled_irqs = 0;

    DEBUG("[kw41zrf] _isr_event_seq_r\n");

    if (irqsts & ZLL_IRQSTS_RXWTRMRKIRQ_MASK) {
        handled_irqs |= ZLL_IRQSTS_RXWTRMRKIRQ_MASK;
        if (_kw41zrf_hal_dev->cb) {
            *hal_event = IEEE802154_RADIO_INDICATION_RX_START;
            *indicate_hal_event = true;
            return handled_irqs; /* don't process further events on RX_START */
        }
    }

    if (irqsts & ZLL_IRQSTS_FILTERFAIL_IRQ_MASK) {
        KW41ZRF_LED_RX_OFF;
        handled_irqs |= ZLL_IRQSTS_FILTERFAIL_IRQ_MASK;
    }

    if (irqsts & ZLL_IRQSTS_RXIRQ_MASK) {
        KW41ZRF_LED_RX_ON;
        handled_irqs |= ZLL_IRQSTS_RXIRQ_MASK;
        if (ZLL->PHY_CTRL & ZLL_PHY_CTRL_AUTOACK_MASK) {
            KW41ZRF_LED_TX_ON;
        }
    }

    if (irqsts & ZLL_IRQSTS_TXIRQ_MASK) {
        KW41ZRF_LED_TX_OFF;
        handled_irqs |= ZLL_IRQSTS_TXIRQ_MASK;
    }

    if (irqsts & ZLL_IRQSTS_SEQIRQ_MASK) {
        uint32_t seq_ctrl_sts = ZLL->SEQ_CTRL_STS;

        handled_irqs |= ZLL_IRQSTS_SEQIRQ_MASK;
        KW41ZRF_LED_TX_OFF;
        kw41zrf_abort_sequence(&intern_dev);

        if (!(irqsts & ZLL_IRQSTS_CRCVALID_MASK)) {
            if (_kw41zrf_hal_dev->cb) {
                *hal_event = IEEE802154_RADIO_INDICATION_CRC_ERROR;
                *indicate_hal_event = true;
            }
        }
        else if ((seq_ctrl_sts & (ZLL_SEQ_CTRL_STS_TC3_ABORTED_MASK |
                                  ZLL_SEQ_CTRL_STS_PLL_ABORTED_MASK |
                                  ZLL_SEQ_CTRL_STS_SW_ABORTED_MASK)) > 0) {
            assert(1);
        }
        /* No error reported */
        else {
            if (_kw41zrf_hal_dev->cb) {
                *hal_event = IEEE802154_RADIO_INDICATION_RX_DONE;
                *indicate_hal_event = true;
            }
        }
    }
    return handled_irqs;
}

/* Handler for Transmit sequence */
static uint32_t _isr_event_seq_t(kw41zrf_t *dev, uint32_t irqsts,
                                 bool *indicate_hal_event,
                                 ieee802154_trx_ev_t *hal_event)
{
    (void)dev;
    uint32_t handled_irqs = 0;

    DEBUG("[kw41zrf] _isr_event_seq_t\n");

    if (irqsts & ZLL_IRQSTS_TXIRQ_MASK) {
        handled_irqs |= ZLL_IRQSTS_TXIRQ_MASK;
    }

    if (irqsts & ZLL_IRQSTS_SEQIRQ_MASK) {
        handled_irqs |= ZLL_IRQSTS_SEQIRQ_MASK;

        kw41zrf_abort_sequence(&intern_dev);
        intern_dev.tx_status = TX_STATUS_SUCCESS;
        KW41ZRF_LED_TX_OFF;

        if (_kw41zrf_hal_dev->cb) {
            *hal_event = IEEE802154_RADIO_CONFIRM_TX_DONE;
            *indicate_hal_event = true;
        }
    }
    return handled_irqs;
}

/* Handler for Transmit/Receive sequence */
static uint32_t _isr_event_seq_tr(kw41zrf_t *dev, uint32_t irqsts,
                                  bool *indicate_hal_event,
                                  ieee802154_trx_ev_t *hal_event)
{
    uint32_t handled_irqs = 0;

    DEBUG("[kw41zrf] _isr_event_seq_tr\n");

    if (irqsts & ZLL_IRQSTS_TXIRQ_MASK) {
        KW41ZRF_LED_RX_ON;
        handled_irqs |= ZLL_IRQSTS_TXIRQ_MASK;
        /* TX done, now waiting for ACK - START timer NOW */
        if (kw41zrf_ack_requested(dev)) {
            /* Set timeout from current time */
            kw41zrf_timer_set(dev, &ZLL->T3CMP, IEEE802154_ACK_TIMEOUT_SYMS);
            bit_set32(&ZLL->PHY_CTRL, ZLL_PHY_CTRL_TMR3CMP_EN_SHIFT);

            DEBUG("[kw41zrf] wait for RX ACK (timeout set)\n");
        }
    }

    if (irqsts & ZLL_IRQSTS_RXIRQ_MASK) {
        KW41ZRF_LED_RX_OFF;
        handled_irqs |= ZLL_IRQSTS_RXIRQ_MASK;
    }

    if (irqsts & ZLL_IRQSTS_FILTERFAIL_IRQ_MASK) {
        handled_irqs |= ZLL_IRQSTS_FILTERFAIL_IRQ_MASK;
    }

    if (irqsts & ZLL_IRQSTS_SEQIRQ_MASK) {
        uint32_t seq_ctrl_sts = ZLL->SEQ_CTRL_STS;
        handled_irqs |= ZLL_IRQSTS_SEQIRQ_MASK;
        KW41ZRF_LED_TX_OFF;
        KW41ZRF_LED_RX_OFF;

