RIOT-OS/RIOT/drivers/kw41zrf/kw41zrf_radio_ops.c
        /* Disable RX Timeout */
        bit_clear32(&ZLL->PHY_CTRL, ZLL_PHY_CTRL_TC3TMOUT_SHIFT);
        bit_clear32(&ZLL->PHY_CTRL, ZLL_PHY_CTRL_TMR3CMP_EN_SHIFT);

        kw41zrf_abort_sequence(&intern_dev);
        if (irqsts & ZLL_IRQSTS_TMR3IRQ_MASK) {
            handled_irqs |= ZLL_IRQSTS_TMR3IRQ_MASK;
        }

        if (seq_ctrl_sts & ZLL_SEQ_CTRL_STS_PLL_ABORTED_MASK) {
            /* if this does happen in development, it's worth checking why */
            assert(false);
        }
        else if (seq_ctrl_sts & ZLL_SEQ_CTRL_STS_TC3_ABORTED_MASK) {
            intern_dev.tx_status = TX_STATUS_NO_ACK;
            if (_kw41zrf_hal_dev->cb) {
                *hal_event = IEEE802154_RADIO_CONFIRM_TX_DONE;
                *indicate_hal_event = true;
            }
        }
        else if ((seq_ctrl_sts & ZLL_SEQ_CTRL_STS_SW_ABORTED_MASK)) {
            /* Software aborted, no callback needed */
            assert(false);
        }
        else {
            /* No error reported */
            intern_dev.tx_status = intern_dev.cca_busy ? TX_STATUS_MEDIUM_BUSY : TX_STATUS_SUCCESS;
            if (_kw41zrf_hal_dev->cb) {
                *hal_event = IEEE802154_RADIO_CONFIRM_TX_DONE;
                *indicate_hal_event = true;
            }
        }
    }
    return handled_irqs;
}

static void kw41zrf_radio_hal_irq_handler(void *dev)
{
    (void)dev;
    DEBUG("[kw41zrf] kw41zrf_radio_hal_irq_handler\n");

    kw41zrf_mask_irqs();

    /* ZLL register access requires that the transceiver is not in deep sleep mode */
    if (kw41zrf_is_dsm()) {
        /* Transceiver is sleeping, the IRQ must have occurred before entering
         * sleep, discard the call */
        kw41zrf_unmask_irqs();
        return;
    }

    uint32_t irqsts = ZLL->IRQSTS;
    /* Clear all IRQ flags now */
    ZLL->IRQSTS = irqsts;

    uint32_t handled_irqs = 0;
    bool indicate_hal_event = false;
    ieee802154_trx_ev_t hal_event;

    uint8_t seq = kw41zrf_get_sequence(&intern_dev);

    switch (seq) {
    case XCVSEQ_RECEIVE:
        handled_irqs |= _isr_event_seq_r(&intern_dev, irqsts, &indicate_hal_event, &hal_event);
        break;

    case XCVSEQ_IDLE:
        if (irqsts & ZLL_IRQSTS_SEQIRQ_MASK) {
            handled_irqs |= ZLL_IRQSTS_SEQIRQ_MASK;
        }
        break;

    case XCVSEQ_TRANSMIT:
        /* First check CCA flags */
        handled_irqs |= _isr_event_seq_t_ccairq(&intern_dev, irqsts);
        /* Then TX flags */
        handled_irqs |= _isr_event_seq_t(&intern_dev, irqsts & ~handled_irqs, &indicate_hal_event,
                                         &hal_event);
        break;

    case XCVSEQ_CCA:
        handled_irqs |= _isr_event_seq_cca(&intern_dev, irqsts, &indicate_hal_event, &hal_event);
        break;

    case XCVSEQ_TX_RX:
        /* First check CCA flags */
        handled_irqs |= _isr_event_seq_t_ccairq(&intern_dev, irqsts);
        /* Then TX/RX flags */
        handled_irqs |= _isr_event_seq_tr(&intern_dev, irqsts & ~handled_irqs, &indicate_hal_event,
                                          &hal_event);
        break;

    case XCVSEQ_CONTINUOUS_CCA:
        handled_irqs |= _isr_event_seq_cca(&intern_dev, irqsts, &indicate_hal_event, &hal_event);
        break;

    default:
        assert(0);
        break;
    }

    irqsts &= ~handled_irqs;
    /* doesn't need handling; just prevent outputting an error below */
    irqsts &= ~ZLL_IRQSTS_RXWTRMRKIRQ_MASK;

    /* Enable IRQs first */
    kw41zrf_unmask_irqs();

    /* Then call the callback if needed */
    if (indicate_hal_event && _kw41zrf_hal_dev->cb) {
        _kw41zrf_hal_dev->cb(_kw41zrf_hal_dev, hal_event);
    }
}

int _config_phy(ieee802154_dev_t *hal, const ieee802154_phy_conf_t *conf)
{
    (void)hal;
    int8_t pow = conf->pow;
    uint8_t channel = conf->channel;

    DEBUG("[kw41zrf] config_phy\n");

    if (pow < KW41ZRF_OUTPUT_POWER_MIN || pow > KW41ZRF_OUTPUT_POWER_MAX) {
        return -EINVAL;
    }
    kw41zrf_set_tx_power(&intern_dev, pow);
    kw41zrf_set_channel(&intern_dev, channel);
    return 0;
}

int kw41zrf_reset(void)
{
    DEBUG("[kw41zrf] reset\n");
    kw41zrf_mask_irqs();

    /* Sometimes (maybe 1 in 30 reboots) there is a failure in the vendor
     * routines in kw41zrf_rx_bba_dcoc_dac_trim_DCest() that can be worked
     * around by retrying. Clearly this is not ideal.
     */
    for (int retries = 0; ; retries++) {
        int res = kw41zrf_reset_hardware(&intern_dev);
        if (!res) {
            break;
        }
        if (retries == MAX_BOOT_RETRIES) {
            kw41zrf_unmask_irqs();
            return res;
        }
    }

    kw41zrf_set_power_mode(&intern_dev, KW41ZRF_POWER_IDLE);
    kw41zrf_set_tx_power(&intern_dev, KW41ZRF_DEFAULT_TX_POWER);
    kw41zrf_set_channel(&intern_dev, KW41ZRF_DEFAULT_CHANNEL);
    kw41zrf_set_cca_type(&intern_dev, KW41ZRF_CCATYPE_MODE1);
    kw41zrf_set_rx_watermark(&intern_dev, 1);
    kw41zrf_set_option(&intern_dev, KW41ZRF_OPT_AUTOACK, true);
    kw41zrf_set_option(&intern_dev, KW41ZRF_OPT_CCA_BEFORE_TX, true);
    kw41zrf_abort_sequence(&intern_dev);
    kw41zrf_unmask_irqs();

    return 0;
}

int kw41zrf_init(void)
{
    DEBUG("[kw41zrf] init\n");

    /* Save a copy of the RF_OSC_EN setting to use when the radio is in deep sleep */
    intern_dev.rf_osc_en_idle = RSIM->CONTROL & RSIM_CONTROL_RF_OSC_EN_MASK;
    intern_dev.pm_blocked = 0;
    kw41zrf_mask_irqs();
    kw41zrf_set_irq_callback(kw41zrf_radio_hal_irq_handler, &intern_dev);

    /* Perform clean reset of the radio modules. */
    int res = kw41zrf_reset();
    if (res < 0) {
        /* Restore saved RF_OSC_EN setting */
        RSIM->CONTROL = (RSIM->CONTROL & ~RSIM_CONTROL_RF_OSC_EN_MASK) | intern_dev.rf_osc_en_idle;
        return res;
    }
    /* Radio is now on and idle */

    /* Allow radio interrupts */
    kw41zrf_unmask_irqs();

    bit_clear32(&ZLL->PHY_CTRL, ZLL_PHY_CTRL_RX_WMRK_MSK_SHIFT);
    bit_clear32(&ZLL->PHY_CTRL, ZLL_PHY_CTRL_TXMSK_SHIFT);
    return 0;
}

void kw41zrf_hal_setup(ieee802154_dev_t *hal)
{
    DEBUG("[kw41zrf] hal_setup\n");
    /* We don't set &intern_dev because the context of this device is global.
     * We need to store a reference to the HAL descriptor though for the ISR */
    hal->driver = &kw41zrf_ops;
    _kw41zrf_hal_dev = hal;
}

static const ieee802154_radio_ops_t kw41zrf_ops = {
    .caps = IEEE802154_CAP_24_GHZ
            | IEEE802154_CAP_PHY_OQPSK
            | IEEE802154_CAP_IRQ_CRC_ERROR
            | IEEE802154_CAP_IRQ_TX_DONE
            | IEEE802154_CAP_IRQ_RX_START
            | IEEE802154_CAP_IRQ_CCA_DONE
            | IEEE802154_CAP_IRQ_ACK_TIMEOUT
            | IEEE802154_CAP_AUTO_ACK
            | IEEE802154_CAP_SRC_ADDR_MATCH,
    .write = _write,
    .read = _read,
    .request_on = _request_on,
    .confirm_on = _confirm_on,
    .len = _len,
    .off = _off,
    .request_op = _request_op,
    .confirm_op = _confirm_op,
    .set_cca_threshold = _set_cca_threshold,
    .set_cca_mode = _set_cca_mode,
    .config_phy = _config_phy,
    .set_csma_params = _set_csma_params,
    .config_addr_filter = _config_addr_filter,
    .config_src_addr_match = _config_src_addr_match,
    .set_frame_filter_mode = _set_frame_filter_mode,
    .get_frame_filter_mode = _get_frame_filter_mode,
};
